src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеОтрабатыватьИзменениеНабора")
		И ДополнительныеСвойства.НеОтрабатыватьИзменениеНабора Тогда
		Возврат;
	Иначе
		
		ДополнительныеСвойства.Вставить("ДанныеДляОпределенияИзменений", ДанныеДляОпределенияИзменений());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ДанныеДляОпределенияИзменений")
		Или ДополнительныеСвойства.ДанныеДляОпределенияИзменений = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = РаботаСРезультатамиОбмена.УсловиеЗапросаПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтарыйНабор.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	СтарыйНабор.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	СтарыйНабор.ОбъектФормата           КАК ОбъектФормата,
	|	СтарыйНабор.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	СтарыйНабор.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	СтарыйНабор.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ СтарыйНабор
	|ИЗ
	|	&СтарыйНабор КАК СтарыйНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ПолученныйОбъект        КАК ПолученныйОбъект,
	|	ТаблицаРегистра.ПравилоКонвертации      КАК ПравилоКонвертации,
	|	ТаблицаРегистра.ОбъектФормата           КАК ОбъектФормата,
	|	ТаблицаРегистра.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ТаблицаРегистра.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ТаблицаРегистра.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ НовыйНабор
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ТаблицаРегистра
	|ГДЕ
	|	&УсловиеЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	НовыйНабор.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	НовыйНабор.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	НовыйНабор.УзелПланаОбмена         КАК УзелПланаОбмена
	|ИЗ
	|	НовыйНабор КАК НовыйНабор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтарыйНабор.ОбъектКПолучению,
	|	СтарыйНабор.ОбъектФорматаКПолучению,
	|	СтарыйНабор.УзелПланаОбмена
	|ИЗ
	|	СтарыйНабор КАК СтарыйНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	СтарыйНабор.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	СтарыйНабор.ПравилоКонвертации КАК ПравилоКонвертации,
	|	СтарыйНабор.ОбъектФормата      КАК ОбъектФормата,
	|	СтарыйНабор.УзелПланаОбмена    КАК УзелПланаОбмена
	|ИЗ
	|	СтарыйНабор КАК СтарыйНабор
	|ЛЕВОЕ СОЕДИНЕНИЕ НовыйНабор КАК НовыйНабор
	|	ПО СтарыйНабор.ПолученныйОбъект  = НовыйНабор.ПолученныйОбъект
	|	И СтарыйНабор.ПравилоКонвертации = НовыйНабор.ПравилоКонвертации
	|	И СтарыйНабор.ОбъектФормата      = НовыйНабор.ОбъектФормата
	|	И СтарыйНабор.ОбъектКПолучению   = НовыйНабор.ОбъектКПолучению
	|ГДЕ
	|	НовыйНабор.ОбъектКПолучению IS NULL
	|";
	
	Запрос.УстановитьПараметр("СтарыйНабор", ДополнительныеСвойства.ДанныеДляОпределенияИзменений);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗапроса", ТекстУсловия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КлючОбрабатывающегоЗадания = Неопределено;
	Если ДополнительныеСвойства.Свойство("КлючОбрабатывающегоЗадания")
		И Не ПустаяСтрока(ДополнительныеСвойства.КлючОбрабатывающегоЗадания) Тогда
		
		КлючОбрабатывающегоЗадания = ДополнительныеСвойства.КлючОбрабатывающегоЗадания;
		
	КонецЕсли; 
	
	РегистрыСведений.КоличествоБлокируемыхОбъектовКЗагрузке.РассчитатьДанныеПоТаблицеОбъектов(РезультатЗапроса[2].Выгрузить());
	РегистрыСведений.ОбъектыКЗагрузке.ОтразитьИзмененияПриУстановкеСоответствийОбъектамПоТаблице(РезультатЗапроса[3].Выгрузить(),
	                                                                                             КлючОбрабатывающегоЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеДляОпределенияИзменений()
	
	Возврат РаботаСРезультатамиОбмена.ТаблицаЗаписейПоОтборуНабораЗаписей(
		Отбор,
		"ОбъектыБлокирующиеЗагрузку", "ПолученныйОбъект, ПравилоКонвертации, ОбъектКПолучению, УзелПланаОбмена, ОбъектФормата, ОбъектФорматаКПолучению");
	
КонецФункции

#КонецОбласти


#КонецЕсли
